In [1]:
import numpy as np
import pandas as pd

In [2]:
# ocupa 80% ou mais do tempo de um analista

In [3]:
# Tratando dados ausentes

In [7]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado']) # o valor nan é conhecido como valor sentinela
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0] = None

In [10]:
string_data.isnull() # o valor None é conhecido também como valor nan

0     True
1    False
2     True
3    False
dtype: bool

In [12]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [14]:
string_data.dropna() # pega somente os valores que não são nan

1    artichoke
3      avocado
dtype: object

In [18]:
string_data.fillna('fill') # preenche os nan

0         fill
1    artichoke
2         fill
3      avocado
dtype: object

In [19]:
string_data.fillna('bfill') # preenche os nan

0        bfill
1    artichoke
2        bfill
3      avocado
dtype: object

In [20]:
string_data.notnull()

0    False
1     True
2    False
3     True
dtype: bool

In [21]:
# Filtrando dados ausentes

In [6]:
from numpy import nan as NA

In [23]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [24]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.dropna() # equivalente a função de baixo

0    1.0
2    3.5
4    7.0
dtype: float64

In [27]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1, NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data.dropna() # se tiver apenas um valor NA ele já não pega mais

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all') # apenas as colunas que contenham somente NAs

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA # quarta coluna vira tudo NA

In [15]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(how="all", axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df = pd.DataFrame(np.random.randn(7, 3))

In [18]:
df

          0         1         2
0  1.234570  0.667491 -1.083025
1  1.779963 -0.136033  0.038459
2 -0.927562  0.880371  0.471582
3 -0.416527  1.479074 -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [19]:
df.iloc[:4, 1] = NA
df

          0         1         2
0  1.234570       NaN -1.083025
1  1.779963       NaN  0.038459
2 -0.927562       NaN  0.471582
3 -0.416527       NaN -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [20]:
df.iloc[:2, 2] = NA
df

          0         1         2
0  1.234570       NaN       NaN
1  1.779963       NaN       NaN
2 -0.927562       NaN  0.471582
3 -0.416527       NaN -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [23]:
df.dropna(thresh=2) # removeu os ultimos

          0         1         2
2 -0.927562       NaN  0.471582
3 -0.416527       NaN -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [24]:
df

          0         1         2
0  1.234570       NaN       NaN
1  1.779963       NaN       NaN
2 -0.927562       NaN  0.471582
3 -0.416527       NaN -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [26]:
df.iloc[0, 0] = NA
df

          0         1         2
0       NaN       NaN       NaN
1  1.779963       NaN       NaN
2 -0.927562       NaN  0.471582
3 -0.416527       NaN -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [28]:
df.dropna(thresh=1) # remove 1 em todos os NaN cuidado com o axis default

          0         1         2
1  1.779963       NaN       NaN
2 -0.927562       NaN  0.471582
3 -0.416527       NaN -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [30]:
df.dropna() # pega só os puros, linha e coluna sem na

          0         1         2
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [31]:
# Preenchendo dados ausentes

In [32]:
df.fillna(0)

          0         1         2
0  0.000000  0.000000  0.000000
1  1.779963  0.000000  0.000000
2 -0.927562  0.000000  0.471582
3 -0.416527  0.000000 -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [33]:
df.fillna({0: 0.5, 1: 0.5, 2: 0}) # o que quer fazer atráves das colunas

          0         1         2
0  0.500000  0.500000  0.000000
1  1.779963  0.500000  0.000000
2 -0.927562  0.500000  0.471582
3 -0.416527  0.500000 -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [37]:
_ = df.fillna(0, inplace=True) #  inplace True, ou seja os valores modificam permanente

In [38]:
df

          0         1         2
0  0.000000  0.000000  0.000000
1  1.779963  0.000000  0.000000
2 -0.927562  0.000000  0.471582
3 -0.416527  0.000000 -0.499527
4 -1.960035 -0.250509 -0.809780
5  1.332815  0.341067  0.244641
6  1.029540  1.337191 -0.917586

In [39]:
df = pd.DataFrame(np.random.randn(6, 3))
df

          0         1         2
0  0.743370  0.934751  1.297001
1 -1.206709 -0.801806  0.001480
2 -0.288961 -0.487732 -0.325912
3 -1.325775  1.238328  0.541716
4  0.391746  2.055831 -0.052300
5  1.548932 -0.134037  1.163274

In [41]:
df.iloc[2:, 1] = NA
df

          0         1         2
0  0.743370  0.934751  1.297001
1 -1.206709 -0.801806  0.001480
2 -0.288961       NaN -0.325912
3 -1.325775       NaN  0.541716
4  0.391746       NaN -0.052300
5  1.548932       NaN  1.163274

In [42]:
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.743370  0.934751  1.297001
1 -1.206709 -0.801806  0.001480
2 -0.288961       NaN -0.325912
3 -1.325775       NaN  0.541716
4  0.391746       NaN       NaN
5  1.548932       NaN       NaN

In [45]:
df.fillna(method='ffill') # na coluna o ultimo valor acima de nan, copia ele

          0         1         2
0  0.743370  0.934751  1.297001
1 -1.206709 -0.801806  0.001480
2 -0.288961 -0.801806 -0.325912
3 -1.325775 -0.801806  0.541716
4  0.391746 -0.801806  0.541716
5  1.548932 -0.801806  0.541716

In [47]:
df

          0         1         2
0  0.743370  0.934751  1.297001
1 -1.206709 -0.801806  0.001480
2 -0.288961       NaN -0.325912
3 -1.325775       NaN  0.541716
4  0.391746       NaN       NaN
5  1.548932       NaN       NaN

In [48]:
df.fillna(method='ffill', limit=2) # os dois primeiros da coluna

          0         1         2
0  0.743370  0.934751  1.297001
1 -1.206709 -0.801806  0.001480
2 -0.288961 -0.801806 -0.325912
3 -1.325775 -0.801806  0.541716
4  0.391746       NaN  0.541716
5  1.548932       NaN  0.541716

In [49]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [50]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [51]:
# Transformação de dados